Q.1 : Create a ranking of students based on score (highest first).

..>> Below is a simple SQL query to create a ranking of students based on their scores, with the highest score ranked first.

Using RANK() (Handles Ties)
SELECT
    student_id,
    student_name,
    score,
    RANK() OVER (ORDER BY score DESC) AS rank
FROM students;

Alternative Ranking Options
1ï¸âƒ£ DENSE_RANK() (No Gaps in Ranking)
SELECT
    student_id,
    student_name,
    score,
    DENSE_RANK() OVER (ORDER BY score DESC) AS rank
FROM students;

2ï¸âƒ£ ROW_NUMBER() (Unique Rank, Even if Scores Tie)
SELECT
    student_id,
    student_name,
    score,
    ROW_NUMBER() OVER (ORDER BY score DESC) AS rank
FROM students;

Example Output
student_name	score	RANK	DENSE_RANK	ROW_NUMBER
Aditi	95	1	1	1
Rahul	92	2	2	2
Neha	92	2	2	3
Aman	88	4	3	4
When to Use Which?
Function	Use Case
RANK()	Competition ranking (ties skip ranks)
DENSE_RANK()	Academic ranking (no gaps)
ROW_NUMBER()	Unique ordering required
âœ… Key Takeaway

Window functions (RANK, DENSE_RANK, ROW_NUMBER) are the correct and efficient way to create rankings in SQL.

Q.2 Show each student's score and the previous studentâ€™s score (based on score order).

..>> You can do this using the LAG() window function, which lets you access the value from the previous row based on a specified order.

SQL Query (Using LAG())
SELECT
    student_id,
    student_name,
    score,
    LAG(score) OVER (ORDER BY score DESC) AS previous_score
FROM students;

Explanation

ORDER BY score DESC â†’ Orders students from highest to lowest score

LAG(score) â†’ Fetches the previous studentâ€™s score in that order

For the top-ranked student, previous_score will be NULL

Example Output
student_name	score	previous_score
Aditi	95	NULL
Rahul	92	95
Neha	90	92
Aman	88	90
Optional: Handle NULL for First Row

If you want to replace NULL with 0 or a label:

SELECT
    student_name,
    score,
    COALESCE(LAG(score) OVER (ORDER BY score DESC), 0) AS previous_score
FROM students;

âœ… Key Concept

LAG() is ideal for comparing current rows with previous rows without using self-joins, making queries cleaner and more efficient.

Q.3 Convert all student names to uppercase and extract the month name from join_date.

...>> You can achieve this using string and date functions.

SQL Query
SELECT
    UPPER(student_name) AS student_name_uppercase,
    score,
    join_date,
    MONTHNAME(join_date) AS join_month
FROM students;

Explanation

UPPER(student_name) â†’ Converts all student names to uppercase

MONTHNAME(join_date) â†’ Extracts the month name (e.g., January, February) from join_date

Example Output
student_name_uppercase	score	join_date	join_month
ADITI	95	2024-01-15	January
RAHUL	90	2024-03-10	March
ðŸ”¹ Notes

Works in MySQL

For other databases:

PostgreSQL: TO_CHAR(join_date, 'Month')

SQL Server: DATENAME(MONTH, join_date)

Q.4 Show each student's name and the next studentâ€™s attendance (ordered by attendance).

...>> You can use the LEAD() window function to get the next studentâ€™s attendance based on attendance order.

SQL Query (Using LEAD())
SELECT
    student_name,
    attendance,
    LEAD(attendance) OVER (ORDER BY attendance) AS next_student_attendance
FROM students;

Explanation

ORDER BY attendance â†’ Orders students from lowest to highest attendance

LEAD(attendance) â†’ Returns the next studentâ€™s attendance in that order

For the last student, next_student_attendance will be NULL

Example Output
student_name	attendance	next_student_attendance
Aman	65	72
Rahul	72	80
Neha	80	90
Aditi	90	NULL
âœ… Key Concept

LEAD() allows you to look ahead to the next row without using self-joins, making the query clean and efficient.

Q.5  Assign students into 4 performance groups using NTILE().

...>> SQL Query (Using NTILE(4))
SELECT
    student_id,
    student_name,
    score,
    NTILE(4) OVER (ORDER BY score DESC) AS performance_group
FROM students;

Explanation

NTILE(4) â†’ Divides students into 4 roughly equal groups

ORDER BY score DESC â†’ Highest scores go into Group 1

performance_group values range from 1 to 4

Example Interpretation
performance_group	Meaning
1	Top performers
2	Above average
3	Below average
4	Low performers
Example Output
student_name	score	performance_group
Aditi	95	1
Rahul	88	1
Neha	76	2
Aman	65	3
Riya	55	4
âœ… Key Takeaway

NTILE() is ideal for bucketing or segmentation, such as grading bands or performance tiers, without complex calculations.

Q.6  For each course, assign a row number based on attendance (highest first).

...>> SQL Query
SELECT
    course_id,
    course_name,
    student_id,
    student_name,
    attendance,
    ROW_NUMBER() OVER (
        PARTITION BY course_id
        ORDER BY attendance DESC
    ) AS row_num
FROM students;

Explanation

PARTITION BY course_id â†’ Restarts row numbering for each course

ORDER BY attendance DESC â†’ Highest attendance gets row number 1

Example Output
course_name	student_name	attendance	row_num
SQL	Aditi	95	1
SQL	Rahul	90	2
Python	Neha	98	1
Python	Aman	85	2
âœ… Key Concept

ROW_NUMBER() with PARTITION BY is used when you want ranking within groups (here, per course).

Q.7 : Calculate the number of days each student has been enrolled (from join_date to today).

(Assume current date = '2025-01-01')

..>> SQL Query
SELECT
    student_id,
    student_name,
    join_date,
    DATEDIFF('2025-01-01', join_date) AS days_enrolled
FROM students;

Explanation

DATEDIFF(end_date, start_date) â†’ Returns the number of days between two dates

'2025-01-01' â†’ Assumed current date

join_date â†’ Studentâ€™s enrollment date

Example Output
student_name	join_date	days_enrolled
Aditi	2024-01-15	352
Rahul	2024-03-10	297
Neha	2024-06-05	210
Aman	2024-09-01	122
ðŸ”¹ Notes

PostgreSQL: Use

('2025-01-01'::date - join_date)::int


SQL Server: Use

DATEDIFF(DAY, join_date, '2025-01-01')

Q.8  Format join_date as â€œMonth Yearâ€ (e.g., â€œJune 2023â€).


..>> You can format join_date to display as â€œMonth Yearâ€ using built-in date formatting functions, depending on your database.

MySQL
SELECT
    student_name,
    join_date,
    DATE_FORMAT(join_date, '%M %Y') AS join_month_year
FROM students;


Explanation:

%M â†’ Full month name (e.g., June)

%Y â†’ 4-digit year

Example Output:

student_name	join_date	join_month_year
Aditi	2024-06-15	June 2024
Rahul	2024-03-10	March 2024
PostgreSQL
SELECT
    student_name,
    join_date,
    TO_CHAR(join_date, 'Month YYYY') AS join_month_year
FROM students;

SQL Server
SELECT
    student_name,
    join_date,
    FORMAT(join_date, 'MMMM yyyy') AS join_month_year
FROM students;

âœ… Key Takeaway

Use DATE_FORMAT / TO_CHAR / FORMAT to display dates in custom readable formats.

Useful for reports, dashboards, and user-friendly output.

Q.9 : Replace the city â€˜Mumbaiâ€™ with â€˜MUMâ€™ for display purposes?

...>> You can replace a value for display purposes using the SQL CASE statement (or IF in some databases).

Hereâ€™s how to do it:

MySQL / PostgreSQL / SQL Server
SELECT
    student_name,
    city,
    CASE
        WHEN city = 'Mumbai' THEN 'MUM'
        ELSE city
    END AS city_display
FROM students;

Explanation

CASE checks each rowâ€™s city value

If it is 'Mumbai', it displays 'MUM'

Otherwise, it shows the original city

This does not change the data in the table, only how it is displayed

Example Output
student_name	city	city_display
Aditi	Mumbai	MUM
Rahul	Delhi	Delhi
Neha	Mumbai	MUM
ðŸ”¹ Optional Shorter Version (MySQL only)
SELECT
    student_name,
    city,
    IF(city = 'Mumbai', 'MUM', city) AS city_display
FROM students;

Q.10 For each course, find the highest score using FIRST_VALUE().

..>> You can use the FIRST_VALUE() window function to get the highest score per course. The key is to order the scores descending within each course partition.

SQL Query
SELECT
    course_id,
    course_name,
    student_id,
    student_name,
    score,
    FIRST_VALUE(score) OVER (
        PARTITION BY course_id
        ORDER BY score DESC
    ) AS highest_score_in_course
FROM students;

Explanation

PARTITION BY course_id â†’ Resets the calculation for each course

ORDER BY score DESC â†’ Highest score comes first

FIRST_VALUE(score) â†’ Picks the first value in the ordered partition, i.e., the highest score

Example Output
course_name	student_name	score	highest_score_in_course
SQL	Aditi	95	95
SQL	Rahul	90	95
SQL	Neha	88	95
Python	Aman	92	98
Python	Riya	98	98
âœ… Key Takeaway

FIRST_VALUE() returns a value from a specific row in a window

Useful for highlighting top performers, first transactions, or highest/lowest values within groups.